import { Component, OnInit, OnDestroy } from '@angular/core';
import {Router, NavigationEnd} from '@angular/router';
import { EditorChoiceData } from '../editor-choice-panel/edtor-choice-data.model';

@Component({
  selector: 'app-editors-choice',
  templateUrl: './editors-choice.component.html',
  styleUrls: ['./editors-choice.component.css']
})
export class EditorsChoiceComponent implements OnInit, OnDestroy {
  editorChoiceDetails: EditorChoiceData[];

  private navigationSubscription;
  constructor(private router: Router) {
    this.navigationSubscription = this.router.events.subscribe((e: any) => {
      // If it is a NavigationEnd event re-initalise the component
            if (e instanceof NavigationEnd) {
              this.initialize();
            }
          });
  }

  ngOnInit() {
    // this.currentDate = Date.now();
    this.initialize();
  }

  ngOnDestroy() {
    if (this.navigationSubscription) {
      this.navigationSubscription.unsubscribe();
    }
  }

  private initialize() {
    this.editorChoiceDetails = [];
    let article = [];
    // tslint:disable-next-line:max-line-length
    article.push('మొక్కపాటి నరసింహశాస్త్రి సుప్రసిద్ధ తెలుగు హాస్య రచయిత. 1925 లో ప్రచురితమైన ఇతని బారిష్టర్ పార్వతీశం అన్న నవల తెలుగు హాస్య రచనలలో మరువలేని స్థానాన్ని పొందింది.');
    // tslint:disable-next-line:max-line-length
    article.push('ఈ నవలలో ముఖ్య కథానాయకుడైన పార్వతీశం ఒక పల్లెటూరు నుండి బయలుదేరి ఇంగ్లండ్ వెళ్ళి న్యాయశాస్త్రం అభ్యసించి భారత దేశానికి తిరిగి వచ్చి న్యాయశాస్త్రాన్ని ప్రాక్టీసు చేసి మంచి పేరు సంపాందించి కథ చివరిభాగం లో స్వాతంత్ర్యోద్యమం లో పాల్గొంటాడు.ఈ నవల మూడు భాగాలుగా వెలువడింది.ఇందులో మొదటి భాగం అప్పటి నర్సాపురం ప్రాంతం యొక్క సామాజిక స్ధితిగతులను హాస్యరీతిలో తెలియచెప్పుతుంది. ఇది పార్వతీశం ఇంగ్లాండ్ ప్రయాణం, అతని అమాయకత్వం అయోమయం మొదలైనవాటితో వున్న గొప్ప హాస్య రచన.');
    // tslint:disable-next-line:max-line-length
    article.push('పార్వతీశం మొగల్తూరు నుండి బయలు దేరి నిడదవోలు మీదుగా చెన్నై వెళ్తాడు. అక్కడ నుండి ఓడ పట్టుకొని ఇంగ్లాడు చేరుతాడు.ఈ భాగం చాలా హాస్యంగా నడుస్తుంది. ముఖ్యంగా నిడదవోలు నుండి మద్రాసు వెళ్ళే రైలు ప్రయాణం చాలా హాస్యరసంగా చిత్ర్రించడం జరిగింది. మద్రాసు నుండి ఇంగ్లాండు వెళ్ళడానికి కావలసిన సరంజామా కొనుక్కొనే సన్నివేశాలు చాలా హాస్యవత్తరంగా ఉంటాయి. ఈ నవలను తెలుగు అకాడమీ పుస్తకాల్లో పదవ తరగతి తెలుగు ఉపవాచకముగా అందించారు');
    // tslint:disable-next-line:max-line-length
    article.push('ఓడలో ఇంగ్లండ్ చేరు కొన్న పార్వతీశం ఓడలో చిక్కిన స్నేహితుడి వల్ల స్కాట్‌లాండ్ లో ఎడిన్‌బరా నగరంలో ఒక ఇంట్లో పేయింగ్ గెస్టు గా చేరుతాడు. ఒక లా కాలేజి లో చేరుతాడు. ఆంగ్లం కుడా రాని పార్వతీశం ఏకసంధాగ్రహి క్రింద అన్ని విషయాలు ఒక్కసారి చెప్పడం తో గ్రహించి అందరి మన్ననలు పొందుతాడు. ఒక స్నేహితురాలిని ఆసక్తికరమైన సన్నివేశం ద్వారా పొందుతాడు. హాస్యం పాళ్ళు ఈ భాగం లొ తగ్గినా ఈ భాగం రసవత్తరంగానే ఉంటుంది. ఈ భాగం చివరి అంకం లొ బారిష్టర్ పాసై ఇంటి ప్రయాణం పట్టుతాడు. తన స్నేహితురాలు వదిలి వెళ్ళే సన్నివేశాన్ని మొక్కపాటి నరసింహశాస్త్రి గారు చాలా చక్కగా చిత్రించారు.');
    // tslint:disable-next-line:max-line-length
    article.push('మూడవ భాగం ముఖ్యంగా ఇంటివచ్చాక తనని ఇంటి వారు ఏవిధంగా స్వీకరించారు అనే విషయాలు, అప్పటి సాంప్రదాయల ప్రకారం బయటి దేశం నుండి వచ్చిన వారు ఎదుర్కొనే సంఘటనలు చిత్రించారు. ఇంగ్లాండు నుండి వచ్చాక గ్రామంలో ఉన్నవారు అడిగే వివిధమైన విచిత్ర ప్రశ్నలు చాలా అసక్తికరంగా ఉంటాయి. తరువాత పెళ్ళి, న్యాయశాస్త్ర ప్రాక్టీసు, స్వాతంత్ర్యోద్యమంలో పాల్గొనడం, ప్రకాశం పంతులు గారిని కలవడం, తాను సంపాదించిన సంపదను స్వాతంత్ర్యోద్యమానికి ధార పోయడం, పలు మార్లు జైలుకి వెళ్ళడం అనే విషయాలు ఉంటాయి. హాస్యం పాళ్ళు ఈ భాగంలో మరింత తగ్గుతుంది.');
    // tslint:disable-next-line:max-line-length
    article.push('ఒక ప్రముఖుని (పేరు తెలియదు) మాటలలో........ "ఒక రోజు కాలేజి నుంచి ఇంటి కొచ్చే సరికి మా ఇంటి అరుగు మీద వాలు కుర్చీలో కూర్చొని మా పిల్లలకి కథలు చెప్తూ నవ్విస్తున్నారు.. బారిస్టర్ పార్వతీశం నవలా రచయిత మొక్క పాటి నరసింహ శాస్త్రి గారు. కుశల ప్రశ్నలు అయింతర్వాత వచ్చిన పని చెప్పారు.');
    // tslint:disable-next-line:max-line-length
    article.push('"వాడెవడో చెప్పితే నమ్మి ఐదు వేల కాపీలేశాను బారిస్టర్ పార్వతీశం. పది హేనేళ్లయింది. ఇంకా పదిహేను వందల పుస్తకాలు మిగిలి వున్నాయి. ఈ వూళ్లొ నాలుగైదు హైస్కూళ్లున్నాయంట గదా.... ఒక్కొక్క హైస్కూలు ఇరవై అయిదు చొప్పున కొన వచ్చట. అంతా కొంటే వంద పుస్తకాలు ఖర్చు అవుతాయి. కాపి రూపాయా పావలా... రేప్పొద్దున వెళ్లి ఒక్కొక్క హెడ్మాస్టర్ ను కలుసు కోవాలి. పని ఎంత వరకు అవుతుందో? "...... నాకు చాల భాద కలిగింది. బారిస్టర్ పర్వతీశం అంటే ఒక హాస్య మహా కావ్వం. దాన్ని అమ్ముకోడానికి రచయిత ప్రతి హైస్కూలుకూ ఎక్కే గుమ్మం దిగే గుమ్మంగా యాచించడమా?');
    article.push('"ఎన్ని పుస్తకాలు తెచ్చారు" అనడిగాను.');
    article.push('"వంద. అంటే నూట పాతిక రూపాయిలవి"');
    // tslint:disable-next-line:max-line-length
    article.push('"మీరెక్కడికి వెళ్లకండి. అవి అమ్ముడయే మార్గం నేను చూస్తాను" అన్నాను. ఆ మర్నాడు ఒక తెల్ల కాగితం మీది ఒక ఆహ్వాన పత్రికను రాశాను ఇలా. "మొక్క పాటి వారు వచ్చారు. వారి బారిస్టర్ పార్వతీశం నవల వారి సంతకం తో ఇస్తారు. పుస్తకం వెల ఎంత వున్నా పుస్తకం తీసుకున్నవారు మాత్రం వారికి పది రూపాయలివ్వాలి. జేబులో పదేసి రూపాయిలేసుకొని రేపు సాయింత్రం ఆరు గంటలకి స్థానిక లైబ్రరి దడాబామీద జరిగే భావపురి రచయితల సమావేశానికి రావలసింది" అంటూ ఒక విధ్యార్తికి ఆ కాగితం ఇచ్చి వూళ్లో వున్న లెక్చరర్లు, ప్లీడర్లు, ఉద్యోగులు, విద్యావంతులు ఇతర పుర ప్రముఖులలు చూపించి, వారు చూసి నట్లు సంతకాలు చేయించుకొని రమ్మని పంపించాను.');
    // tslint:disable-next-line:max-line-length
    article.push('కాగితం మీద సంతకాలయితే అరవై మంది చేశారు. కాని సభకు వచ్చి మొక్క పాటి వారి సంతకంతో వున్న నవలని పదిరూపాయిలిచ్చి తీసుకోడానికి, ఆయన ఉపన్యాసం వినడానికి నూట పది మంది వచ్చారు. పుస్తకాలు వందే వుండడం వల్ల పది మందికి ఇవ్వలేక పోయాము. కాని రచయితకి గంటలో వెయ్యి రూపాలొచ్చాయి. అదీ ఎలా? భక్తి ప్రవుత్తులతో సంర్పించినవి. మొక్క పాటి వారు ఎంత సంతోషించారో.... నా చేతులు పట్టుకొని " నూట పాతిక వస్తే చాలనుకున్నాను. కాని వెయ్యి రూపాయిలొచ్చాయి.... నీ వల్లనే" అన్నారు. క్షమించండి ఇది నావల్ల గాదు, బాపట్లలో వున్న రసజ్ఞుల వల్ల ... ఒక మంచి గ్రంధాన్ని ... రచయిత చేతుల మీదుగా తీసుకోవాలనే అకాంక్ష వుండడం వల్లా....... ఇది వీరందరి రసజ్ఞత.. సంస్కారమూను.." అన్నాను. అదే ఈ రోజుల్లో అయితే సాద్యమేనా?');
    // tslint:disable-next-line:max-line-length
    article.push('1940లో విడుదలయ్యిన బారిస్టర్ పార్వతీశం సినిమా తెలుగులో మొట్టమొదటి హస్యకథా చిత్రం. మొక్కపాటి నరిశింహ శాస్త్రి రచించిన బారిస్టర్ పార్వతీశం నవల ఆధారంగా ఈ సినిమాను నిర్మించారు. ఈ సినిమాకు ఎచ్.ఎమ్.రెడ్డి దర్శకత్వం వహించాడు. లంక సత్యం ప్రధాన పాత్రలో నటించగా జి.వరలక్ష్మి పార్వతీశం భార్యగా నటించింది. ఈ సినిమా అనుకున్నంత అర్థిక విజయం సాధించలేకపోయినా మొదటి తెలుగు హస్యకథ సినిమాగా గుర్తింపు తెచ్చుకుంది.');
    // tslint:disable-next-line:max-line-length
    article.push('--వికీపీడియా నుండి మరియు తెలుగు సాహిత్యం దాట్కాం సౌజన్యంతో');

    this.editorChoiceDetails.push(new EditorChoiceData(
      'http://tagkc.net/media/k2/items/cache/358873fad4914931314b94f2036b503a_L.jpg',
      'బారిష్టర్ పార్వతీశం',
      // tslint:disable-next-line:max-line-length
      'మొక్కపాటి నరసింహశాస్త్రి సుప్రసిద్ధ తెలుగు హాస్య రచయిత. 1925 లో ప్రచురితమైన ఇతని బారిష్టర్ పార్వతీశం అన్న నవల తెలుగు హాస్య రచనలలో మరువలేని స్థానాన్ని పొందింది. ఈ నవలలో ముఖ్య కథానాయకుడైన పార్వతీశం',
      'January 1, 2019 at 12:00 PM',
      article.join('|'),
      'New User'
    ));

    article = [];
    // tslint:disable-next-line:max-line-length
    article.push('ఏదైనా రాయందే <br/> ఈ క్షణాన్ని పోనీయను <br/> కలాన్ని పిండేయందే <br/> కాలాన్ని కదలనీయను <br/> అవసరమైనప్పుడల్లా <br/> అగ్నిపుల్లతో-చీకటి <br/> కొవ్వును కరిగించందే <br/> కొత్తపొద్దు రానీయను');
    // tslint:disable-next-line:max-line-length
    article.push('అని ప్రతిజ్ఞ చేసి కవిత్వం నా మాతృభాష, కవిత నా శ్వాస, కవిత నా చిరునామా అని ప్రకటించి ఇతివృత్తం మానవత్వం అని ఉద్ఘాటించి సతతహరితంగా సాహితీ సృజనచేస్తున్న కవితా పథిóకుడు డా.సి.నారాయణ రెడ్డిగారు. ఏడు దశాబ్దాల నుంచి మానవచైతన్య చిత్రణమే ప్రధాన వస్తువుగా ఎంచుకున్న సినారె సరికొత్త ప్రక్రియలతో ఆధునిక తెలుగు సాహిత్యాన్ని విస్తృత పరిచారు. ఉత్తుంగ సాహితీశిఖరంలా నిలిచారు. నడక నా తల్లి, పరుగునా తండ్రి, సమత నా భాష అనే కవితాక్షరామ్నాయంలో సంస్కృతీ నాగరికతల అమృతభావనలను పొందుపరిచి అనంతరం నా పయనం, విశ్వం నా ఊరు, శాంతి నా పేరు అని మానవత మూల్యాలను వర్ణించి సంప్రదాయాన్ని జీర్ణించుకున్న, ప్రయోగాన్ని, ప్రయోగంలో జీవిస్తున్న సంప్రదాయాన్ని, అని ప్రయోగశాలిగా, పరిణామవేదిగా అద్భుత చరిత్రను సృష్టించుకున్న దార్శనికుడు సినారె గారు.');
    // tslint:disable-next-line:max-line-length
    article.push('ఆధునిక తెలుగు సాహిత్యాన్ని ఒక మలుపు తిప్పిన సినారె గారు 29 జూలై 1931న కరీంనగర్‌ జిల్లా వేములవాడ ప్రాంతంలోని హనుమాజిపేట గ్రామంలో బుచ్చమ్మ మల్లారెడ్డి దంపతుల కళ్ల వెలుగులా జన్మించారు. బాల్య తొలిదశలోనే ఆయన గుండెలో కవిత్వం పాటరూపంలో దూసుకొచ్చింది. సొంత ఊరు చుట్టూ అల్లుకున్న పంటచేళ్ల హృదయరాగం, అక్కడి సెలయేళ్ల నడకల ఒయ్యారాలు హరికథకుల గీతాలు ప్రేరణ అయ్యాయి. ఎదుగుతున్న వయస్సుతో పాటు పాట కూడా కొత్త నడకలతో సాగింది.');
    // tslint:disable-next-line:max-line-length
    article.push('సినారె పూర్తి పేరు సింగిరెడ్డి సత్యనారాయణ రెడ్డి "సత్య" శబ్ద సాహిత్యంలోని చేరింది. ఇంటిపేరులోని "సింగి" చైతన్య రూపంలో విస్తరించింది. అలా కాగా సి. నారాయణరెడ్డి అనే పేరు సినారెగా జగత్ప్రసిద్ధమైంది.');
    // tslint:disable-next-line:max-line-length
    article.push('సినారెగారు 1953-55 సం||లో ఉస్మానియా విశ్వ విద్యాలయంలో తెలుగు సాహిత్యంలో ఎంఏ చదివి 1962లో పిహెచ్‌డి పట్టాపొందారు. 1963లో ఉస్మానియా విశ్వవిద్యా లయంలో రీడర్‌, 1976లో ఆచార్యులుగా విద్యార్థులకు తెలుగుభాషా సాహిత్యాలను బోధించారు. అదే సమయంలో పరిశోధక విద్యార్థులకు పర్యవేక్షకులుగా పనిచేశారు. ఉస్మానియా విశ్వవిద్యాలయంలో రీడర్‌ 1976లో ఆచార్యులుగా విద్యార్థులకు తెలుగుభాషా సాహిత్యాలను బోధించారు. అదే సమయంలో పరిశోధక విద్యార్థులకు పర్యవేక్షకులుగా పనిచేశారు. పిదప 1981-1985 వరకు అధికార భాషా సంఘాధ్యక్షుడుగా, దేశంలో ప్రథమ సార్వత్రిక విశ్వవిద్యాలయం డా.బి.ఆర్‌. అంబేద్కర్‌ విశ్వవిద్యాలయానికి వైస్‌ ఛాన్సలర్‌గా 1989-92 వరకు పొట్టి శ్రీరాములు తెలుగు విశ్వవిద్యాలయానికి వైస్‌ ఛాన్సలర్‌గా, ఆమహోన్నత విద్యాపీఠాల ప్రగతికి చక్కని ప్రణాళికలు రూపొందించి మేధావుల ప్రశంసలందారు.1992 రాష్ట్రభాషా సాంస్కృతిక సలహాదారుగా 1997లో ఆంధ్రప్రదేశ్‌ రాష్ట్ర సాంస్కృతిక మండలి అధ్యక్షుడిగా 1997 నుంచి 2003 దాకా రాజ్యసభ సభ్యులుగా విశిష్ట సేవలందించారు. ఈ పదవిని అందుకున్న తొలి దక్షిణభారత కవి నారాయణ రెడ్డి గారే. ఆ మహాకవి చాలా కావ్యాలకు రాష్ట్ర కేంద్ర సాహిత్య అకాడమి అవార్డులతో "విశ్వంభర"కు అత్యున్నత భారతీయ జ్ఞానపీఠ అవార్డు లభించింది.');
    // tslint:disable-next-line:max-line-length
    article.push('సినారెగారి సాహిత్యాన్ని గురించి వివిధ విశ్వవిద్యాలయాల్లో పరిశోధనలు జరిగాయి. ఇప్పుడు ఆ ప్రక్రియ సాగుతూనే వుంది. అంతేకాక ఆయన పేరుతో సాహిత్య సంస్థలు ఏర్పడ్డాయి. ఆయన పేరుతో విశిష్ట పురస్కారాలు కూడా ప్రదానం చేయబడుతున్నాయి. ఆయన పాటలు పాడి ఎందరో కళాకారులు సుప్రసిద్ధగాయకులయ్యారు. దేశంలో కొన్ని విశ్వవిద్యాలయాలు గౌరవడాక్టరేట్లు సమర్పించి వాటి కీర్తి ప్రతిష్టలను పెంచుకున్నాయి. రాష్ట్రంలో, దేశంలో విదేశాల్లో విస్తృతంగా పర్యటించి తెలుగుభాషా సౌందర్యాలను చాటిచెప్పారు.');
    // tslint:disable-next-line:max-line-length
    article.push('సినారె విద్యార్థి దశలోనే కిన్నెర, శోభ, తెలుగు, స్వతంత్ర, ఆంధ్రప్రభ వంటి పత్రికల్లో కవితలు, వ్యాసాలు, ప్రకటించారు. అవి సాహితీపరుల హృదయాలను అలరిస్తుండేవి.');
    // tslint:disable-next-line:max-line-length
    article.push('సినారెగారికి బాల్యదశలోనే సంస్కరణ దృక్పథం అలవడింది');
    // tslint:disable-next-line:max-line-length
    this.editorChoiceDetails.push(new EditorChoiceData(
      'http://tagkc.net/media/k2/items/cache/e7b279be6a862d254f0e7cc4dde2874e_XL.jpg',
      'మానవతా పరిమళ ప్రవాహం సినారె కవిత్వం',
      // tslint:disable-next-line:max-line-length
      'ఆధునిక తెలుగు సాహిత్యాన్ని ఒక మలుపు తిప్పిన సినారె గారు 29 జూలై 1931న కరీంనగర్‌ జిల్లా వేములవాడ ప్రాంతంలోని హనుమాజిపేట గ్రామంలో బుచ్చమ్మ మల్లారెడ్డి దంపతుల కళ్ల వెలుగులా జన్మించారు. బాల్య తొలిదశలోనే',
      'January 2, 2019 at 12:00 PM',
      article.join('|'),
      'Old User'
    ));

    article = [];
    article.push('జననం-విద్యాభ్యాసం');
    // tslint:disable-next-line:max-line-length
    article.push('సురవరం ప్రతాపరెడ్డి 1896, మే 28న మహబూబ్‌నగర్‌ జిల్లా గద్వాల సంస్థానంలోని అమలాపురం సమీపంలోని ఇటిక్యాల పాడులో జన్మించారు. వీరు కేవలం 58 సంవత్సరాలు మాత్రమే జీవించారు. తాను బతికినంత కాలం తెలుగుభాషోద్ధారకునిగా, సాహిత్య చైతన్యదీప్తిగా, పైపెచ్చు సాంఘీక సంస్కర్తగా పనిచేశారు.');
    // tslint:disable-next-line:max-line-length
    article.push('1954 ఆగస్టు 25న మరణించారు. ప్రతాపరెడ్డి తండ్రి చిన్నతనం లోనే మరణించారు. ఆయన చిన్నాన్న రామక్రిష్ణారెడ్డి ఎబియం మిషనరీ పాఠశాలలో ప్రాధమిక విద్యను హైదరాబాద్‌ నిజాం కళాశాలలో ఇంటర్మీడియట్‌, మద్రాస్‌ ప్రెసిడెన్సీ మరదలు పద్మావతిని 1916లో వివాహం చేసుకున్నారు. సంతానం పదిమందికాగా, ఇద్దరు కుమారులు విగతజీవులు. నలుగురు కుమారులు, నలుగురుపుత్రికల సంతానం. సురవరం ప్రతాపరెడ్డి తన చదువు పూర్తికాగానే హైదరాబాద్‌ కొత్వాల్‌గా వున్న రాజబహదుర్‌ వేంకట్రామిరెడ్డి ఆధ్వర్యంలోని రెడ్డి హాస్టల్‌కు ఆయన కోరికపై వచ్చారు. ఇక్కడ ఆయన పనిచేసిన దశాబ్ది కాలంలో రెడ్డి హాస్టల్‌ నిర్వహణను ఒక విద్యాలయంగా తీర్చిదిద్దారు. నాటి నైవాసిక విద్యార్థులలో దేశభక్తి బీజాలను నాటారు. 1924 ప్రాంతంలో ఈహాస్టల్‌ వదాన్యుల సహకారంతో స్థాపించబడింది. ఆ విధంగా హైదరాబాద్‌లో రెడ్డి సాంఘీక సేవా జీవితం పునాదులు వేసింది. మద్రాస్‌ కళాశాలలో చదువుతున్న ప్పుడే నాటి జాతీయ ఉద్యమ ప్రభావం ఆయనపై పడింది. నిజాం రాష్ట్రాంధ్ర దుస్థితి రూపురేఖలను మార్చాలన్న తపన ఆనాటి నుండే సురవరం మనస్సులో నాటుకొని పోయింది. హాస్టల్‌ కార్యదర్శిగా వచ్చాక, వేయి గ్రంథాలున్న హాస్టల్‌ లైబ్రరరీని 11వేల గ్రంథాల వరకు పెంచి, విద్యార్థులలో భాషాభివృద్ధికి కృషి చేశారు.');
    // tslint:disable-next-line:max-line-length
    article.push('జోగిపేట ప్రథమాంధ్రమహాసభ - 1930 1930, మార్చి, 3,4,5 తేదీలలో జోగిపేటలో మూడురోజులపాటు ప్రథమాంధ్ర మహాసభలు జరిగాయి. ఆనాటి సభలకు హైకోర్టు న్యాయవాదిగా ఉన్న సురవరం అధ్యకత వహించారు. 60 మంది ప్రతినిధులతో ఈ సభలలో పాల్గొన్నారు. సంగారెడ్డిమీదుగా జోగిపేటకు అందోల్‌ మీదుగా సత్కారాలు అందుకుని వచ్చారు. ఆనాటి సభలో రెడ్డి చేసిన ప్రసంగం చైతన్య స్ఫోరకమైనది. తెలుగు మాతృభాష దుస్థితిపై వారు ఎంతగా వ్యాకులపడిన విధం మనకు కనిపిస్తుంది. అక్కన్న మాదన్నల తర్వాత హైదరాబాద్‌ సంస్థానంలో భాషా పరంగా, రాజకీయంగా మనం బలహీనులమై పోయామని, ఈ దుస్థితి రావడానికి లోపాలను కనుక్కోవాలని అన్నారు. మన మాతృభాషను కాపాడుకోవాలని, ఉర్దూ రాజ్యమేలుతున్న హైకోర్టు, ఉస్మానియా విశ్వవిద్యాలయంలోను తెలుగు ఇతర భాషలకు చుక్కెదురు కావడాన్ని ఆయన నిరసించారు. నూటికి 90 శాతం కాని ప్రజలకు ఉర్దూభాషను విద్యాలయాలలో బోధనా భాషగా రుద్దుతుండడాన్ని ఆయన తప్పుపట్టారు. బలవన్మా ఘస్నానం వలన ఎవ్వరు ఏమి కట్టుకుందరో ఊహింపజాలమని ఆయన తన ఆదేవనను వ్యక్తం చేశారు. ఆనాటి మహాసభలలో వారి రాజకీయ గురువులు మాడ పాటి హన్మంతరావు, పులిజాల రంగారావు, ఉన్నవ వేంకట్రా మయ్య, వామననాయక్‌, అనంత వెంకటరావు, కృష్ణస్వామి ముదిరాజ్‌, దూపాటి వెంకట రమణాచార్యులు, భాగ్యరెడ్డివర్మ, ఎం. నారాయణరావు, ఆది రాజు వీరభద్రరావు, వేంకటేశం గుప్త, మహిళా ప్రతినిధి నడింపల్లి సుందరమ్మ తదితరలులు పాల్గొని, వివిధ తీర్మాణాలను ప్రతిపాదించినారు.');
    // tslint:disable-next-line:max-line-length
    article.push('సురవరం ప్రతాపరెడ్డి 1896, మే 28న మహబూబ్‌నగర్‌ జిల్లా గద్వాల సంస్థానంలోని అమలాపురం సమీపంలోని ఇటిక్యాల పాడులో జన్మించారు. వీరు కేవలం 58 సంవత్సరాలు మాత్రమే జీవించారు. తాను బతికినంత కాలం తెలుగుభాషోద్ధారకునిగా, సాహిత్య చైతన్యదీప్తిగా, పైపెచ్చు సాంఘీక సంస్కర్తగా పనిచేశారు.');
    // tslint:disable-next-line:max-line-length
    article.push('1954 ఆగస్టు 25న మరణించారు. ప్రతాపరెడ్డి తండ్రి చిన్నతనం లోనే మరణించారు. ఆయన చిన్నాన్న రామక్రిష్ణారెడ్డి ఎబియం మిషనరీ పాఠశాలలో ప్రాధమిక విద్యను హైదరాబాద్‌ నిజాం కళాశాలలో ఇంటర్మీడియట్‌, మద్రాస్‌ ప్రెసిడెన్సీ మరదలు పద్మావతిని 1916లో వివాహం చేసుకున్నారు. సంతానం పదిమందికాగా, ఇద్దరు కుమారులు విగతజీవులు. నలుగురు కుమారులు, నలుగురుపుత్రికల సంతానం. సురవరం ప్రతాపరెడ్డి తన చదువు పూర్తికాగానే హైదరాబాద్‌ కొత్వాల్‌గా వున్న రాజబహదుర్‌ వేంకట్రామిరెడ్డి ఆధ్వర్యంలోని రెడ్డి హాస్టల్‌కు ఆయన కోరికపై వచ్చారు. ఇక్కడ ఆయన పనిచేసిన దశాబ్ది కాలంలో రెడ్డి హాస్టల్‌ నిర్వహణను ఒక విద్యాలయంగా తీర్చిదిద్దారు. నాటి నైవాసిక విద్యార్థులలో దేశభక్తి బీజాలను నాటారు. 1924 ప్రాంతంలో ఈహాస్టల్‌ వదాన్యుల సహకారంతో స్థాపించబడింది. ఆ విధంగా హైదరాబాద్‌లో రెడ్డి సాంఘీక సేవా జీవితం పునాదులు వేసింది. మద్రాస్‌ కళాశాలలో చదువుతున్న ప్పుడే నాటి జాతీయ ఉద్యమ ప్రభావం ఆయనపై పడింది. నిజాం రాష్ట్రాంధ్ర దుస్థితి రూపురేఖలను మార్చాలన్న తపన ఆనాటి నుండే సురవరం మనస్సులో నాటుకొని పోయింది. హాస్టల్‌ కార్యదర్శిగా వచ్చాక, వేయి గ్రంథాలున్న హాస్టల్‌ లైబ్రరరీని 11వేల గ్రంథాల వరకు పెంచి, విద్యార్థులలో భాషాభివృద్ధికి కృషి చేశారు.');
    // tslint:disable-next-line:max-line-length
    article.push('జోగిపేట ప్రథమాంధ్రమహాసభ - 1930 1930, మార్చి, 3,4,5 తేదీలలో జోగిపేటలో మూడురోజులపాటు ప్రథమాంధ్ర మహాసభలు జరిగాయి. ఆనాటి సభలకు హైకోర్టు న్యాయవాదిగా ఉన్న సురవరం అధ్యకత వహించారు. 60 మంది ప్రతినిధులతో ఈ సభలలో పాల్గొన్నారు. సంగారెడ్డిమీదుగా జోగిపేటకు అందోల్‌ మీదుగా సత్కారాలు అందుకుని వచ్చారు. ఆనాటి సభలో రెడ్డి చేసిన ప్రసంగం చైతన్య స్ఫోరకమైనది. తెలుగు మాతృభాష దుస్థితిపై వారు ఎంతగా వ్యాకులపడిన విధం మనకు కనిపిస్తుంది. అక్కన్న మాదన్నల తర్వాత హైదరాబాద్‌ సంస్థానంలో భాషా పరంగా, రాజకీయంగా మనం బలహీనులమై పోయామని, ఈ దుస్థితి రావడానికి లోపాలను కనుక్కోవాలని అన్నారు. మన మాతృభాషను కాపాడుకోవాలని, ఉర్దూ రాజ్యమేలుతున్న హైకోర్టు, ఉస్మానియా విశ్వవిద్యాలయంలోను తెలుగు ఇతర భాషలకు చుక్కెదురు కావడాన్ని ఆయన నిరసించారు. నూటికి 90 శాతం కాని ప్రజలకు ఉర్దూభాషను విద్యాలయాలలో బోధనా భాషగా రుద్దుతుండడాన్ని ఆయన తప్పుపట్టారు. బలవన్మా ఘస్నానం వలన ఎవ్వరు ఏమి కట్టుకుందరో ఊహింపజాలమని ఆయన తన ఆదేవనను వ్యక్తం చేశారు. ఆనాటి మహాసభలలో వారి రాజకీయ గురువులు మాడ పాటి హన్మంతరావు, పులిజాల రంగారావు, ఉన్నవ వేంకట్రా మయ్య, వామననాయక్‌, అనంత వెంకటరావు, కృష్ణస్వామి ముదిరాజ్‌, దూపాటి వెంకట రమణాచార్యులు, భాగ్యరెడ్డివర్మ, ఎం. నారాయణరావు, ఆది రాజు వీరభద్రరావు, వేంకటేశం గుప్త, మహిళా ప్రతినిధి నడింపల్లి సుందరమ్మ తదితరలులు పాల్గొని, వివిధ తీర్మాణాలను ప్రతిపాదించినారు.');
    // tslint:disable-next-line:max-line-length
    article.push('మాలమాలయని మచ్చరించి మీ <br/> సాలుదువ్వెదవదేలా! <br/> మాలడే మహామంత్రియైన పూ <br/> మాలవేసెదవదేలా!');
    // tslint:disable-next-line:max-line-length
    article.push('ఇలాంటివి మరెన్నో గేయాలు ఆ మహాకవి కలం నుంచి సమాజహృదయంలోకి దూసుకొచ్చి చిద్విలాసంగా పనిచేశాయి. సినారె శ్రామిక జనపక్షపాతి. వారి త్యాగనిరతిని, ఆ చెమటలోని అందాలను గూర్చి ఎన్నో కావ్యాల్లో వర్ణించారు.');
    // tslint:disable-next-line:max-line-length
    article.push('శ్రమజీవి చెమట బిందువులో <br/> ఆణిముత్యమూ వుంది <br/> అగ్నిగోళమూ వుంది');
    // tslint:disable-next-line:max-line-length
    article.push('శలక్షచేతులు పండించే ధాన్యం <br/> ఒక్కలోగిట్లో పరచుకుంటే <br/> కోట్ల చెమటబొట్లు కురిసే మూల్యం <br/> ఒక్క గుప్పిట్లో అణిగి వుంటే <br/> అచ్చమైన సౌజన్యం <br/> చచ్చుపీనుగులా పడి వుంటుందా?<br/>రెచ్చిపోయిన రక్తఘోషతో<br/> చిచ్చురెక్కలు సాచకుంటుందా <br/>అప్పుడు జ్వలించేది తిరుగుబాటేకదా! <br/> నరభోక్తలు మానవతను <br/> నంజుకు తింటున్నప్పుడు <br/> పరశక్తులు స్వజాతిపై <br/> విరుచుకుపడుతున్నప్పుడు <br/> కత్తులతో పాటుపైకి <br/> సుత్తెలెత్తిపట్టించే<br/> అడుగులతో పాటు పదును <br/> కొడవళ్ళను కదిలించే <br/> నాగళ్ళను, రోకళ్ళను నడిపించే <br/> నౌకర్లను, పాలేర్లను ఉరిమించే <br/> తిరుగుబాటులో కవితా <br/> స్వరముద్రికలున్నవి');
    // tslint:disable-next-line:max-line-length
    article.push('అని తిరుగుబాటు కవిత్వం ప్రత్యేకతను తెలుపుతారు.');
    // tslint:disable-next-line:max-line-length
    article.push('అణచివేతలతో గాయపడ్డ/మట్టిగుండె అలాగే వుండిపోదు. చతికిలబడదు. చిచ్చులా చెలరేగుతుంది. ఆ హృదయంలో విచ్చుకున్న జ్వాలల ధ్వనులు డప్పుల నాదంతో బహిర్గమ వుతుంది. అది భీకరమృగరాజు గర్జనలా వుంటుంది. డప్పంటే మూరెడు తోలుపేలికకాదు మట్టిగుండెల ఘోషలను పుక్కిటపట్టుకున్న మహోగ్రమృగేంద్ర కంఠం తన రచనల్లో మానవత్వాన్ని ప్రధానంగా ఉల్లేఖించే సినారెగారు');
    // tslint:disable-next-line:max-line-length
    article.push('ఏ కులము వెన్నెలది? <br/> తెమ్మరలెట్టి జాతికి చెందినట్టివి? <br/> అట్టిదే కదా మానవత్వము  <br/> అన్నిటికీ ఎతైన సత్యము అనడం ఆయన సదాశయాన్ని ప్రకటిస్తుంది.');
    // tslint:disable-next-line:max-line-length
    article.push('మతం ఏదైనప్పటికీ అందులో ప్రతిపాదింపబడిన ధర్మాలు ఒక్కటే. దురభిమానం రగిలించుకుని కలహిస్తే మానవత్వం మలినమవుతుందనే విశిష్ట ధర్మాన్ని నొక్కి చెబుతారు సినారెగారు.');
    // tslint:disable-next-line:max-line-length
    article.push('ఎవడు హిందు ఏవడు తురక ఎవడురా కిరస్తానీ? <br/> ఎవరిది తెలుగెవరిది రవమెవరిది హిందుస్తానీ <br/> ఒకేతోట వికసించిన రకరకాల పువ్వులురా <br/> ఒకేవాణి గుడిలో <br/> గొందిన మణిదివ్వెలురా!');
    // tslint:disable-next-line:max-line-length
    article.push('ఇలాంటివే మత సామరస్యాన్ని పెంపొందించే గీతాలు సినారె కలం నుంచి అసంఖ్యాకంగా వెలువడ్డాయి. అందులో కొన్ని లలితగేయాలై మరికొన్ని చిత్రగీతాలై సమాజహృదయంలో ప్రవేశించి మతవిద్వేషాలను తగ్గించడంలో ఉపకరించాయి.');
    // tslint:disable-next-line:max-line-length
    article.push('సినారెగారి ఆకాంక్ష <br/> ఒక్కనోరు <br/> వందభాషలుపలకాలని <br/> రెండు చేతులు <br/> వెయ్యి సముద్రాలు ఈదాలని <br/> లక్ష ఊహలు <br/> పది పంక్తుల్లో ఒదగాలని <br/> కోటి ఉద్యమాలు');
    // tslint:disable-next-line:max-line-length
    article.push('ఒక్క ప్రగతిగా వెలగాలని అనే ఆయన సంకల్పం వజ్రతుల్యమైంది.నవ్వనిపువ్వు నాటినుంచి అలలెత్తే అడుగులు (2013) దాకా వెలువడిన సినారె (83) రచనల సమాజం-సమాజానికి హృదయం లాంటి మనిషి గురించి, ప్రకృతి మానవప్రకృతికి మధ్య వున్న అనుబంధాల గురించే అధికంగా ప్రస్తావింపబడింది. ఆమహాకవి అక్షరం గీస్తే, పదం రాలిస్తే, పాదాన్ని చిలకరిస్తే అది అద్భుతకవిత్వమై రసజ్ఞ జగత్తును మురిపిస్తూంది. వయస్సులో ఎనభైమూడు వసంతాలు దాటినప్పటికీ ఇంకా యువతతో పోటీపడుతూ శక్తివంతమైన, భావసౌజన్యధారతో భాసిస్తున్న సినారె గారి లక్ష్యంతో ఈ వ్యాసం ముగుస్తుంది.');
    // tslint:disable-next-line:max-line-length
    article.push('రాస్తూ రాస్తూ పోతాను <br/> సిరా ఇంకేవరకు <br/> పోతూ పోతూ రాస్తాను <br/> వపువువాడేవరకు');

    this.editorChoiceDetails.push(new EditorChoiceData(
      'http://tagkc.net/media/k2/items/cache/86e8e67edae9219d12d438efd5f5a939_XL.jpg',
      'తెలుగు సాహిత్యోద్యమనేత సురవరం ప్రతాపరెడ్డి',
      // tslint:disable-next-line:max-line-length
      'తెలుగుభాషకు, తెలుగువారి సమైక్యతకు జవజీవాలు పోసిన మహామహులలో సురవరం ప్రతాపరెడ్డి ఒకరు.వారి జీవిత కాలంలో చేసిన నాలుగు దశాబ్దాల సాహితీ సేవ ఎవరెస్ట్‌ శిఖరం లాంటిది. మహా పరిశోధకుడిగా, రచయితగా, ',
      'January 3, 2019 at 12:00 PM',
      article.join('|'),
      'Super User'
    ));

    article = [];
    // tslint:disable-next-line:max-line-length
    article.push('ఆదిభట్ల నారాయణదాసు 1864 సంవత్సరం ఆగస్టు 31వ తేదీన విజయనగరం జిల్లా బొబ్బిలి మండలం ‘అజ్జాడ’ అగ్రహారంలో శ్రీచయనులు, శ్రీమతి నరసమ్మ పుణ్యదంపతులకు జన్మించారు. పువ్వుపుట్టగానే పరిమళించినట్లు ఈయనకు సూక్ష్మగ్రహత్వం సుమధుర కంఠం, నటన బాల్యంలోనే అలవడ్డాయి.');
    // tslint:disable-next-line:max-line-length
    article.push('హరికథను తన ముఖ్య ప్రవృత్తిగా ఎంచుకొని సాహిత్య సంగీత, నాట్య బహుభాషా పాండిత్యంతో నారాయణదాసుకు సరితూగే పండితులు నాటినుండి నేటివరకూ ఎవరూ లేరని చెప్పడం అతిశయోక్తి కాదు. నారాయణదాసు ఏక సంతాగ్రహి. విజయనగరంలో మెట్రిక్యులేషన్ వరకు విశాఖపట్నం ఎ.వి.ఎన్.కళాశాలలో ఎఫ్.ఎ వరకు విద్యనభ్యసించి ఆ విద్యార్థి దశలోనే ఆంగ్లం, సంస్కృతం, తెలుగు భాషల్లో అపారమైన పాండిత్యాన్ని సంపాదించి చక్కని వాక్యాలతో.. చిక్కని కవితలల్లిన మహాపండితుడు. అవధాన ప్రక్రియలు చేయడం ఈ ప్రఖ్యాతిగాంచి సహ ఉపాధ్యాయుల మెప్పుపొందిన బహుమఖ ప్రజ్ఞాశాలి.');
    // tslint:disable-next-line:max-line-length
    article.push('ఆంధ్రులకే కాక భారతదేశం మొత్తం గర్వించదగ్గ విశ్వకవి రవీంద్రనాథ్ ఠాగూర్(1913) ఆదినారాయణదాసును ‘‘ఈయన మానవ మాత్రుడంటే నేను నమ్మలేకున్నాను’’ అని ప్రశంసించారు. మన రాష్ట్రంలోనే కాకుండా మద్రాసు మైసూరు వంటి సంగీత కళాక్షేత్రాల్లో తన హరికథా గానంతో మరియు వీణావాదనంతో పంచముఖి వంటి తాళావధానాల్తో సంగీత పండితులను నిశే్చష్టుల్ని చేస్తూ ఎన్నో సత్కారాలు బహుమానాలు పొందిన సంగీత సవ్యసాచి. 1883లో తన 19వ యేట కుప్పుస్వామి అనే తమిళుని హరికథ విని ఉత్తేజం పొంది ఆ క్షణమే తనలోగల బహుముఖ ప్రజ్ఞల్ని వేదికపై ప్రదర్శించిన బహుకళాకోవిదుడు. సంస్కృతం, తెలుగు భాషల్లో 17 హరికథలు రచించారు. 1924లో చల్లపల్లిలో గజారోహణం జరిపి చెళ్లపల్లి వేంకటావధానిగారి చేత ‘‘హరికథా పితామహుడు’’ అనే బిరుదు పొందారు. వీరి రచన ‘నవరస తరంగణి’ నభూతో నభవిష్యతి అనటం అతిశయోక్తికాదు.');
    // tslint:disable-next-line:max-line-length
    article.push('1919లో అప్పటి విజయనగర మహారాజా శ్రీ విజయ రామగణపతి తన పేరున ‘విజయరామ గాన పాఠశాల’ స్థాపిస్తే దానికి ప్రధానాచార్యులుగా 1919-1936 వరకు పనిచేసారు. 1942లో పదవీ విరమణ చేస్తూ జీవితాంతం సంగీత సాహిత్య కృషి సాగించారు. లయ జ్ఞానంలో నారాయణదాసుది అందెవేసిన చేయి. శివప్రోక్తమైన శివపంచముఖి తాళావధానాన్ని అవలీలగా సాధనతో 1914లో ప్రదర్శించి ‘లయబ్రహ్మ’ బిరుదు పొందారు.');
    // tslint:disable-next-line:max-line-length
    article.push('దాసుగారిది ఎంతో విశాలమైన హృదయం. అందుకే తను తన సంగీత కళాశాలలో సర్వశ్రీ పేరి రామ్మూర్తి (గాత్రం) కట్టు సూరన్న (వీణ) లింగం లక్ష్మజి (మృదంగం) ద్వారం వెంకటస్వామి నాయుడు (వయొలిన్) వంటి సమర్థులైన అధ్యాపకుల్ని తన పాఠశాలలో పెట్టి పాఠశాల కీర్తిప్రతిష్టలను దశ దిశల వ్యాపింపజేసిన కళాశ్రేష్ట. ఈయన మాట కుండబ్రద్దలు కొట్టినట్లు ఉండేది. ఎవ్వరినీ లెక్కచేయకపోవడంవలన విరోధులు ఉండేవారు. మాటకటువైనా మనసువెన్న. తన కుమార్తె సావిత్రి కుమారునికి స్పోటకం వస్తే దేవి ఉపాసన చేసి వ్యాధిని తనపైకి మళ్ళించుకొని ఆ మనుమడిని రోగవిముక్తిచేసి తను అదే రోగంతో 1945 సంవత్సరం జనవరి 2వ తేదీన దివంగతులయ్యారు. భారతీయులు అన్నికాలాల్లో గుర్తించుకోవలసిన మహా సంగీత, హరికథా విస్వాంసులు అజ్జాడ ఆదిభట్ల నారాయణదాసు.');

    this.editorChoiceDetails.push(new EditorChoiceData(
      'http://tagkc.net/media/k2/items/cache/78a38d90a5f5af5857b8e93fa4dd5a84_XL.jpg',
      '‘హరికథ’కు ఆద్యుడు ఆదిభట్ల',
      // tslint:disable-next-line:max-line-length
      'ఆదిభట్ల నారాయణదాసు 1864 సంవత్సరం ఆగస్టు 31వ తేదీన విజయనగరం జిల్లా బొబ్బిలి మండలం ‘అజ్జాడ’ అగ్రహారంలో శ్రీచయనులు, శ్రీమతి నరసమ్మ పుణ్యదంపతులకు జన్మించారు. పువ్వుపుట్టగానే పరిమళించినట్లు ఈయనకు సూక్ష్మగ్రహత్వం సుమధుర కంఠం, నటన',
      'January 4, 2019 at 12:00 PM',
      article.join('|'),
      'Duper User'
    ));
  }
}
